package com.javarush.task.task01.task0138;

/* 
Любимое стихотворение
В методе main напиши код, чтобы в результате выполнения программы было выведено твое любимое стихотворение.
В стихотворении должно быть не меньше, чем 4 строчки. Не убирай вывод строчки "Мое любимое стихотворение:".

Требования:
•	Программа должна выводить текст.
•	Перед стихом должна быть выведена строка "Мое любимое стихотворение:".
•	Выводимый текст должен состоять не меньше, чем из пяти строк (пустые строки - это тоже строки).
•	В выводимом тексте должно быть не менее, чем 50 символов.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Мое любимое стихотворение:");
        System.out.println("Белеет парус одинокий");
        System.out.println("В тумане моря голубом!...");
        System.out.println("Что ищет он в стране далекой?");
        System.out.println("Что кинул он в краю родном?");  //напишите тут ваш код
    }
}