package com.javarush.task.task01.task0135;

/* 
Белеет парус одинокий
Выведи на экран переменные, значения которых являются названиями фруктов. Каждую переменную выведи с новой строки.

Требования:
•	Программа должна выводить текст.
•	Нельзя изменять строки с объявлением переменных.
•	Выводимый текст должен состоять из 2 строк.
•	Программа должна выводить переменные, значения которых являются названиями фруктов.
•	Программа не должна выводить переменные, значения которых не являются названиями фруктов.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Белеет парус одинокий");
        System.out.println("В тумане моря голубом!...");
        System.out.println("Что ищет он в стране далекой?");
        System.out.println("Что кинул он в краю родном?");
    }
}