package com.javarush.task.task01.task0101;

/* 
Круто быть программистом!
Напиши программу, которая выводит на экран надпись:

Я думаю, быть программистом - это круто

Требования:
•	Программа должна выводить текст.
•	Текст должен начинаться с "Я думаю".
•	Текст должен заканчиваться на "это круто".
•	Текст должен состоять из 39 символов, включая пробелы и знаки препинания.
•	Текст должен состоять из одной строки.
•	Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.print("Я думаю, быть программистом - это круто");
    }
}