package com.javarush.task.task03.task0324;

/* 
Меркантильные намерения
"Я хочу большую зарплату, и для этого изучаю Java"

Требования:
•	Программа не должна считывать данные с клавиатуры.
•	Программа должна выводить текст.
•	Текст должен начинаться с "Я хочу".
•	Текст должен заканчиваться на "изучаю Java".
•	Текст должен состоять из 10 строк.
•	Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        for(int i = 0; i < 10; i++){
        System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        }
    }
}