package com.javarush.task.task01.task0126;

/* 
Не хочешь  - решай нехотя
Напиши программу, которая выводит на экран надпись: "Хочешь - решай задачи, не хочешь - решай нехотя" 16 раз.

Требования:
•	Программа должна выводить текст.
•	Текст должен начинаться с "Хочешь".
•	Текст должен заканчиваться на "нехотя".
•	Текст должен состоять из 16 строк.
•	Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    System.out.println("Хочешь - решай задачи, не хочешь - решай нехотя");
    }
}